cases/bubbleColumn/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       twoComponentLiquidFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

// endTime           20.0;

// deltaT            1e-2;

// writeControl      timeStep;

// writeInterval     10;

endTime         5;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite        0;

writeFormat       binary;

writePrecision    10;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.2;

// functions
// {
//     probes
//     {
//         type probes;

//         libs (sampling);

//         probeLocations
//         (
//             (3.0  2.0  0.0)
//             (3.0 -2.0  0.0)
//         );

//         fields
//         (
//             p
//         );
//     }
// }


// ************************************************************************* //
