cases/bubbleColumn/constant/caseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      caseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho0    rho0    [1 -3 0 0 0 0 0] 1.0; 
nu      nu      [0 2 -1 0 0 0 0] 1.48e-05; 
D       D       [0 2 -1 0 0 0 0] 2.3e-10; 
g       g       [0 1 -2 0 0 0 0] (0 -9.81 0);


// ************************************************************************* //
