cases/bubbleColumn/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



regions
(
    // boxToCell
    // {
    //     box (0.0 1.50 -1) (1.00 3.75 1);
    //     fieldValues
    //     (
    //         volScalarFieldValue rho 2.0
    //     );
    // }

    cylinderToCell
    {
        p1 (0.5 2.5 -1);
        p2 (0.5 2.5 1);
        radius 1.0;
        fieldValues
        (
            volScalarFieldValue rho 20.0
        );

    }
);

// ************************************************************************* //
